jako-dev/bvg-display/esp32/src/main.cpp
/**
 * BVG Departure Display - ESP32 Firmware
 * 
 * Features:
 * - HUB75 LED Matrix (128x32) via DMA
 * - WiFi captive portal for initial setup
 * - Web interface for station configuration
 * - Real-time BVG departure data
 */

#include <Arduino.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <ESPAsyncWebServer.h>
#include <DNSServer.h>
#include <Preferences.h>
#include <ArduinoJson.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <Update.h>

#include "config.h"
#include "font.h"
#include "web_portal.h"

// ===== Globals =====
MatrixPanel_I2S_DMA* matrix = nullptr;
AsyncWebServer server(80);
DNSServer dnsServer;
Preferences prefs;

// State
enum AppMode { MODE_AP_SETUP, MODE_RUNNING };
AppMode appMode = MODE_AP_SETUP;

struct Station {
    String id;
    String name;
    int walkTime;  // Minutes to walk to this station
};

struct Departure {
    String lineName;
    String direction;
    String product;
    int minutesUntil;
    int delaySeconds;
    bool cancelled;
};

Station stations[MAX_STATIONS];
int stationCount = 0;
int activeStationIdx = 0;
Departure departures[BVG_MAX_DEPARTURES];
int departureCount = 0;
int depCountSetting = 6;
bool scrollEnabled = false;       // Scroll disabled by default: show first 3
int scrollSpeedSetting = 3000;    // ms between scroll steps

String wifiSSID = "";
String wifiPassword = "";
unsigned long lastFetchTime = 0;
unsigned long lastScrollTime = 0;
unsigned long lastWifiCheck = 0;
int scrollOffset = 0;
bool ntpSynced = false;

// ===== Forward Declarations =====
void setupMatrix();
void setupAP();
void setupWebServer();
void connectWiFi();
void checkWiFiReconnect();
void syncNTP();
void fetchDepartures();
void parseDeparturesAppend(const String& json);
void sortDepartures();
void renderDisplay();
void renderSetupScreen();
void loadSettings();
void saveSettings();
uint16_t getLineColor(const String& product, const String& lineName);

// ===== Setup =====
void setup() {
    Serial.begin(115200);
    Serial.println("\n=== BVG Display Starting ===");

    setupMatrix();
    loadSettings();

    if (wifiSSID.length() > 0) {
        // Try connecting to saved WiFi
        renderTextCentered("Verbinde...", matrix->color565(255, 204, 0));
        connectWiFi();
    }

    if (WiFi.status() != WL_CONNECTED) {
        // Start AP mode for configuration
        appMode = MODE_AP_SETUP;
        setupAP();
    } else {
        appMode = MODE_RUNNING;
        syncNTP();
    }

    setupWebServer();
    Serial.println("Setup complete. Mode: " + String(appMode == MODE_AP_SETUP ? "AP Setup" : "Running"));
}

// ===== Loop =====
void loop() {
    if (appMode == MODE_AP_SETUP) {
        dnsServer.processNextRequest();
        renderSetupScreen();
        delay(100);
        return;
    }

    // Running mode
    unsigned long now = millis();

    // Check WiFi connectivity every 30s
    if (now - lastWifiCheck >= 30000) {
        checkWiFiReconnect();
        lastWifiCheck = now;
    }

    // Fetch departures periodically
    if (now - lastFetchTime >= BVG_REFRESH_INTERVAL || lastFetchTime == 0) {
        if (WiFi.status() == WL_CONNECTED && ntpSynced) {
            fetchDepartures();
        }
        lastFetchTime = now;
    }

    // Scroll display
    if (now - lastScrollTime >= SCROLL_SPEED) {
        renderDisplay();
        lastScrollTime = now;
    }

    delay(10);
}

// ===== Matrix Setup =====
void setupMatrix() {
    HUB75_I2S_CFG mxconfig(PANEL_WIDTH, PANEL_HEIGHT, PANELS_NUMBER);
    
    mxconfig.gpio.r1 = R1_PIN;
    mxconfig.gpio.g1 = G1_PIN;
    mxconfig.gpio.b1 = B1_PIN;
    mxconfig.gpio.r2 = R2_PIN;
    mxconfig.gpio.g2 = G2_PIN;
    mxconfig.gpio.b2 = B2_PIN;
    mxconfig.gpio.a = A_PIN;
    mxconfig.gpio.b = B_PIN;
    mxconfig.gpio.c = C_PIN;
    mxconfig.gpio.d = D_PIN;
    mxconfig.gpio.e = E_PIN;
    mxconfig.gpio.lat = LAT_PIN;
    mxconfig.gpio.oe = OE_PIN;
    mxconfig.gpio.clk = CLK_PIN;

    mxconfig.clkphase = false;
    mxconfig.driver = HUB75_I2S_CFG::FM6126A;

    matrix = new MatrixPanel_I2S_DMA(mxconfig);
    matrix->begin();
    matrix->setBrightness8(80);
    matrix->clearScreen();
}

// ===== WiFi =====
void setupAP() {
    WiFi.mode(WIFI_AP);
    WiFi.softAP(AP_SSID, AP_PASSWORD);
    
    // Start DNS server for captive portal (redirect all to us)
    dnsServer.start(53, "*", WiFi.softAPIP());
    
    Serial.print("AP started. IP: ");
    Serial.println(WiFi.softAPIP());
}

void connectWiFi() {
    WiFi.mode(WIFI_STA);
    WiFi.setAutoReconnect(true);
    WiFi.begin(wifiSSID.c_str(), wifiPassword.c_str());
    
    unsigned long start = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - start < WIFI_CONNECT_TIMEOUT) {
        delay(250);
        Serial.print(".");
    }
    
    if (WiFi.status() == WL_CONNECTED) {
        Serial.println("\nWiFi connected: " + WiFi.localIP().toString());
    } else {
        Serial.println("\nWiFi connection failed");
        WiFi.disconnect();
    }
}

void checkWiFiReconnect() {
    if (WiFi.status() != WL_CONNECTED) {
        Serial.println("WiFi lost, reconnecting...");
        WiFi.disconnect();
        WiFi.begin(wifiSSID.c_str(), wifiPassword.c_str());
        unsigned long start = millis();
        while (WiFi.status() != WL_CONNECTED && millis() - start < 5000) {
            delay(100);
        }
        if (WiFi.status() == WL_CONNECTED) {
            Serial.println("WiFi reconnected: " + WiFi.localIP().toString());
        }
    }
}

void syncNTP() {
    configTzTime("CET-1CEST,M3.5.0,M10.5.0/3", "pool.ntp.org", "time.nist.gov");
    Serial.print("Syncing NTP");
    int attempts = 0;
    struct tm timeinfo;
    while (!getLocalTime(&timeinfo) && attempts < 10) {
        Serial.print(".");
        delay(500);
        attempts++;
    }
    if (attempts < 10) {
        ntpSynced = true;
        Serial.println(" OK");
    } else {
        ntpSynced = true; // Allow operation with potentially wrong time
        Serial.println(" TIMEOUT (proceeding anyway)");
    }
}

// ===== Web Server =====
void setupWebServer() {
    // Serve the configuration page
    server.on("/", HTTP_GET, [](AsyncWebServerRequest* request) {
        request->send(200, "text/html", getPortalHTML());
    });

