jako-dev/bvg-display/esp32/src/main.cpp
    // Captive portal detection endpoints
    server.on("/generate_204", HTTP_GET, [](AsyncWebServerRequest* request) {
        request->redirect("/");
    });
    server.on("/hotspot-detect.html", HTTP_GET, [](AsyncWebServerRequest* request) {
        request->redirect("/");
    });
    server.on("/fwlink", HTTP_GET, [](AsyncWebServerRequest* request) {
        request->redirect("/");
    });

    // API: Get current status
    server.on("/api/status", HTTP_GET, [](AsyncWebServerRequest* request) {
        JsonDocument doc;
        doc["mode"] = (appMode == MODE_AP_SETUP) ? "setup" : "running";
        doc["wifi_connected"] = (WiFi.status() == WL_CONNECTED);
        doc["wifi_ssid"] = wifiSSID;
        doc["ip"] = WiFi.localIP().toString();
        doc["station_count"] = stationCount;
        doc["departure_count"] = departureCount;
        
        JsonArray stArr = doc["stations"].to<JsonArray>();
        for (int i = 0; i < stationCount; i++) {
            JsonObject st = stArr.add<JsonObject>();
            st["id"] = stations[i].id;
            st["name"] = stations[i].name;
            st["walk_time"] = stations[i].walkTime;
        }

        String response;
        serializeJson(doc, response);
        request->send(200, "application/json", response);
    });

    // API: Save WiFi credentials
    server.on("/api/wifi", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (request->hasParam("ssid", true) && request->hasParam("password", true)) {
            wifiSSID = request->getParam("ssid", true)->value();
            wifiPassword = request->getParam("password", true)->value();
            saveSettings();
            request->send(200, "application/json", "{\"ok\":true,\"msg\":\"WiFi saved. Restarting...\"}");
            delay(1000);
            ESP.restart();
        } else {
            request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Missing ssid or password\"}");
        }
    });

    // API: Scan WiFi networks
    server.on("/api/wifi/scan", HTTP_GET, [](AsyncWebServerRequest* request) {
        int n = WiFi.scanNetworks();
        JsonDocument doc;
        JsonArray networks = doc["networks"].to<JsonArray>();
        for (int i = 0; i < n && i < 20; i++) {
            JsonObject net = networks.add<JsonObject>();
            net["ssid"] = WiFi.SSID(i);
            net["rssi"] = WiFi.RSSI(i);
            net["encrypted"] = (WiFi.encryptionType(i) != WIFI_AUTH_OPEN);
        }
        WiFi.scanDelete();
        String response;
        serializeJson(doc, response);
        request->send(200, "application/json", response);
    });

    // API: Search BVG stations (proxy to avoid CORS on ESP)
    server.on("/api/stations/search", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!request->hasParam("q")) {
            request->send(400, "application/json", "{\"error\":\"Missing q param\"}");
            return;
        }
        if (WiFi.status() != WL_CONNECTED) {
            request->send(503, "application/json", "{\"error\":\"WiFi not connected\"}");
            return;
        }
        String query = request->getParam("q")->value();
        
        HTTPClient http;
        String url = "https://" + String(BVG_API_HOST) + "/locations?query=" + 
                     urlEncode(query) + "&results=5&stops=true&addresses=false&poi=false&pretty=false";
        http.begin(url);
        http.setTimeout(8000);
        int httpCode = http.GET();
        
        if (httpCode == 200) {
            request->send(200, "application/json", http.getString());
        } else {
            request->send(502, "application/json", "{\"error\":\"API request failed\",\"code\":" + String(httpCode) + "}");
        }
        http.end();
    });

    // API: Add station
    server.on("/api/stations", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (request->hasParam("id", true) && request->hasParam("name", true)) {
            if (stationCount >= MAX_STATIONS) {
                request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Max stations reached\"}");
                return;
            }
            String id = request->getParam("id", true)->value();
            // Check for duplicate
            for (int i = 0; i < stationCount; i++) {
                if (stations[i].id == id) {
                    request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Already added\"}");
                    return;
                }
            }
            stations[stationCount].id = id;
            stations[stationCount].name = request->getParam("name", true)->value();
            stations[stationCount].walkTime = 0;
            if (request->hasParam("walk_time", true)) {
                stations[stationCount].walkTime = request->getParam("walk_time", true)->value().toInt();
            }
            stationCount++;
            saveSettings();
            lastFetchTime = 0; // Trigger immediate refresh
            request->send(200, "application/json", "{\"ok\":true}");
        } else {
            request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Missing id or name\"}");
        }
    });

    // API: Remove station
    server.on("/api/stations/remove", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (request->hasParam("id", true)) {
            String id = request->getParam("id", true)->value();
            int found = -1;
            for (int i = 0; i < stationCount; i++) {
                if (stations[i].id == id) { found = i; break; }
            }
            if (found >= 0) {
                for (int i = found; i < stationCount - 1; i++) {
                    stations[i] = stations[i + 1];
                }
                stationCount--;
                if (activeStationIdx >= stationCount) activeStationIdx = 0;
                saveSettings();
                request->send(200, "application/json", "{\"ok\":true}");
            } else {
                request->send(404, "application/json", "{\"ok\":false,\"msg\":\"Not found\"}");
            }
        }
    });

    // API: Update station walk time
    server.on("/api/stations/walktime", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (request->hasParam("id", true) && request->hasParam("walk_time", true)) {
            String id = request->getParam("id", true)->value();
            int wt = request->getParam("walk_time", true)->value().toInt();
            if (wt < 0) wt = 0;
            if (wt > 30) wt = 30;
            for (int i = 0; i < stationCount; i++) {
                if (stations[i].id == id) {
                    stations[i].walkTime = wt;
                    saveSettings();
                    lastFetchTime = 0; // Trigger refresh
                    request->send(200, "application/json", "{\"ok\":true}");
                    return;
                }
            }
            request->send(404, "application/json", "{\"ok\":false,\"msg\":\"Station not found\"}");
        } else {
            request->send(400, "application/json", "{\"ok\":false,\"msg\":\"Missing id or walk_time\"}");
        }
    });

    // Settings GET
    server.on("/api/settings", HTTP_GET, [](AsyncWebServerRequest* request) {
        JsonDocument doc;
        doc["dep_count"] = depCountSetting;
        doc["scroll_enabled"] = scrollEnabled;
        doc["scroll_speed"] = scrollSpeedSetting;
        String response;
        serializeJson(doc, response);
        request->send(200, "application/json", response);
    });

    // Settings POST
    server.on("/api/settings", HTTP_POST, [](AsyncWebServerRequest* request) {
        bool changed = false;
        if (request->hasParam("dep_count", true)) {
            int val = request->getParam("dep_count", true)->value().toInt();
            if (val >= 1 && val <= 15) {
                depCountSetting = val;
                changed = true;
            }
        }
        if (request->hasParam("scroll_enabled", true)) {
            scrollEnabled = request->getParam("scroll_enabled", true)->value() == "1";
            changed = true;
        }
        if (request->hasParam("scroll_speed", true)) {
            int val = request->getParam("scroll_speed", true)->value().toInt();
            if (val >= 1000 && val <= 10000) {
                scrollSpeedSetting = val;
                changed = true;
            }
        }
        if (changed) {
            saveSettings();
            request->send(200, "application/json", "{\"ok\":true}");
        } else {
            request->send(400, "application/json", "{\"ok\":false,\"msg\":\"No valid params\"}");
        }
    });

