jako-dev/bvg-display/esp32/src/main.cpp
    // API: Check for firmware update (GitHub releases)
    server.on("/api/firmware/check", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (WiFi.status() != WL_CONNECTED) {
            request->send(503, "application/json", "{\"error\":\"WiFi not connected\"}");
            return;
        }
        HTTPClient http;
        http.begin(GITHUB_RELEASE_URL);
        http.setTimeout(10000);
        http.addHeader("User-Agent", "ESP32-BVG-Display");
        int httpCode = http.GET();
        if (httpCode != 200) {
            request->send(502, "application/json", "{\"error\":\"GitHub API error\",\"code\":" + String(httpCode) + "}");
            http.end();
            return;
        }
        String payload = http.getString();
        http.end();

        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, payload);
        if (err) {
            request->send(500, "application/json", "{\"error\":\"JSON parse failed\"}");
            return;
        }

        String tagName = doc["tag_name"] | "";
        String releaseName = doc["name"] | tagName;
        String body = doc["body"] | "";
        String downloadUrl = "";

        JsonArray assets = doc["assets"].as<JsonArray>();
        for (JsonObject asset : assets) {
            String name = asset["name"] | "";
            if (name == FW_ASSET_NAME) {
                downloadUrl = asset["browser_download_url"].as<String>();
                break;
            }
        }

        JsonDocument resp;
        resp["current_version"] = FW_VERSION;
        resp["latest_version"] = tagName;
        resp["release_name"] = releaseName;
        resp["release_notes"] = body;
        resp["download_url"] = downloadUrl;
        resp["update_available"] = (tagName != "" && tagName != "v" + String(FW_VERSION) && tagName != String(FW_VERSION));
        String response;
        serializeJson(resp, response);
        request->send(200, "application/json", response);
    });

    // API: OTA update from URL (GitHub release asset)
    server.on("/api/firmware/update", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (!request->hasParam("url", true)) {
            request->send(400, "application/json", "{\"error\":\"Missing url param\"}");
            return;
        }
        String url = request->getParam("url", true)->value();
        // Only allow downloads from GitHub
        if (!url.startsWith("https://github.com/") && !url.startsWith("https://objects.githubusercontent.com/")) {
            request->send(400, "application/json", "{\"error\":\"URL must be from github.com\"}");
            return;
        }

        request->send(200, "application/json", "{\"ok\":true,\"msg\":\"Starting OTA update...\"}");

        // Perform OTA in a delayed task to allow response to be sent
        static String otaUrl;
        otaUrl = url;
        xTaskCreatePinnedToCore([](void* param) {
            delay(500); // Let HTTP response finish
            HTTPClient http;
            http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
            http.begin(otaUrl);
            http.setTimeout(30000);
            http.addHeader("User-Agent", "ESP32-BVG-Display");
            int httpCode = http.GET();

            if (httpCode != 200) {
                Serial.printf("[OTA] Download failed, HTTP %d\n", httpCode);
                http.end();
                vTaskDelete(NULL);
                return;
            }

            int contentLength = http.getSize();
            if (contentLength <= 0) {
                Serial.println("[OTA] Invalid content length");
                http.end();
                vTaskDelete(NULL);
                return;
            }

            WiFiClient* stream = http.getStreamPtr();
            // Validate ESP32 firmware magic byte
            uint8_t firstByte;
            if (stream->peek() != 0xE9) {
                Serial.println("[OTA] Invalid firmware (bad magic byte)");
                http.end();
                vTaskDelete(NULL);
                return;
            }

            if (!Update.begin(contentLength)) {
                Serial.printf("[OTA] Not enough space: %d\n", contentLength);
                http.end();
                vTaskDelete(NULL);
                return;
            }

            Serial.printf("[OTA] Starting update, %d bytes\n", contentLength);
            size_t written = Update.writeStream(*stream);
            if (written == (size_t)contentLength) {
                Serial.println("[OTA] Written successfully");
            } else {
                Serial.printf("[OTA] Written only %d/%d\n", written, contentLength);
            }

            if (Update.end()) {
                if (Update.isFinished()) {
                    Serial.println("[OTA] Update success! Rebooting...");
                    delay(500);
                    ESP.restart();
                } else {
                    Serial.println("[OTA] Update not finished");
                }
            } else {
                Serial.printf("[OTA] Update error: %s\n", Update.errorString());
            }

            http.end();
            vTaskDelete(NULL);
        }, "ota_task", 8192, NULL, 1, NULL, 0);
    });

    // API: Manual firmware upload
    server.on("/api/firmware/upload", HTTP_POST,
        // Response handler (called after upload completes)
        [](AsyncWebServerRequest* request) {
            if (Update.hasError()) {
                request->send(500, "application/json", "{\"ok\":false,\"msg\":\"" + String(Update.errorString()) + "\"}");
            } else {
                request->send(200, "application/json", "{\"ok\":true,\"msg\":\"Update successful! Rebooting...\"}");
                delay(500);
                ESP.restart();
            }
        },
        // Upload handler (called for each chunk)
        [](AsyncWebServerRequest* request, const String& filename, size_t index, uint8_t* data, size_t len, bool final) {
            if (index == 0) {
                Serial.printf("[OTA] Upload start: %s\n", filename.c_str());
                // Validate magic byte
                if (len > 0 && data[0] != 0xE9) {
                    Serial.println("[OTA] Invalid firmware file");
                    Update.abort();
                    return;
                }
                if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
                    Serial.printf("[OTA] Begin failed: %s\n", Update.errorString());
                    return;
                }
            }
            if (Update.isRunning()) {
                if (Update.write(data, len) != len) {
                    Serial.printf("[OTA] Write failed: %s\n", Update.errorString());
                }
            }
            if (final) {
                if (Update.end(true)) {
                    Serial.printf("[OTA] Upload complete: %u bytes\n", index + len);
                } else {
                    Serial.printf("[OTA] Upload end failed: %s\n", Update.errorString());
                }
            }
        }
    );

