jako-dev/bvg-display/esp32/src/main.cpp
    // API: Get firmware version
    server.on("/api/firmware/version", HTTP_GET, [](AsyncWebServerRequest* request) {
        request->send(200, "application/json", "{\"version\":\"" + String(FW_VERSION) + "\"}");
    });

    // Catch-all for captive portal
    server.onNotFound([](AsyncWebServerRequest* request) {
        request->redirect("/");
    });

    server.begin();
    Serial.println("Web server started");
}

// ===== BVG API =====
void fetchDepartures() {
    if (WiFi.status() != WL_CONNECTED || stationCount == 0) return;
    
    // Fetch from all configured stations and merge
    departureCount = 0;

    for (int s = 0; s < stationCount; s++) {
        String url = "https://" + String(BVG_API_HOST) + "/stops/" + stations[s].id + 
                     "/departures?duration=" + String(BVG_DEPARTURE_DURATION) + 
                     "&results=" + String(depCountSetting) + "&pretty=false&language=de";

        HTTPClient http;
        http.begin(url);
        http.setTimeout(10000);
        int httpCode = http.GET();

        if (httpCode == 200) {
            String payload = http.getString();
            int countBefore = departureCount;
            parseDeparturesAppend(payload);
            // Filter this station's departures by its walk time
            if (stations[s].walkTime > 0) {
                int writeIdx = countBefore;
                for (int i = countBefore; i < departureCount; i++) {
                    if (departures[i].minutesUntil >= stations[s].walkTime) {
                        if (writeIdx != i) departures[writeIdx] = departures[i];
                        writeIdx++;
                    }
                }
                departureCount = writeIdx;
            }
            Serial.println("Station " + stations[s].name + ": OK (" + String(departureCount - countBefore) + " deps)");
        } else if (httpCode == 429) {
            Serial.println("Rate limited for " + stations[s].name + ", skipping remaining");
            break; // Don't hammer the API
        } else {
            Serial.println("API error for " + stations[s].name + ": " + String(httpCode));
        }
        http.end();

        // Small delay between multi-station fetches to avoid rate limiting
        if (s < stationCount - 1) delay(200);
    }

    // Sort merged departures by minutesUntil
    sortDepartures();
    scrollOffset = 0;
    Serial.println("Total merged departures: " + String(departureCount));
}

void parseDeparturesAppend(const String& json) {
    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, json);
    if (err) {
        Serial.println("JSON parse error: " + String(err.c_str()));
        return;
    }

    JsonArray deps = doc["departures"].as<JsonArray>();
    if (deps.isNull()) {
        // Fallback: some API versions return array directly
        deps = doc.as<JsonArray>();
        if (deps.isNull()) return;
    }

    for (JsonObject dep : deps) {
        if (departureCount >= BVG_MAX_DEPARTURES) break;

        Departure& d = departures[departureCount];
        d.lineName = dep["line"]["name"].as<String>();
        d.direction = dep["direction"].as<String>();
        d.product = dep["line"]["product"].as<String>();
        d.cancelled = dep["cancelled"] | false;
        d.delaySeconds = dep["delay"] | 0;

        // Calculate minutes until departure
        const char* whenStr = dep["when"] | (const char*)nullptr;
        if (!whenStr) whenStr = dep["plannedWhen"] | (const char*)nullptr;
        
        if (whenStr) {
            // Parse ISO 8601: "2026-05-06T13:09:00+02:00"
            struct tm tm = {};
            int tzHour = 0, tzMin = 0;
            char tzSign = '+';
            int parsed = sscanf(whenStr, "%d-%d-%dT%d:%d:%d%c%d:%d",
                   &tm.tm_year, &tm.tm_mon, &tm.tm_mday,
                   &tm.tm_hour, &tm.tm_min, &tm.tm_sec,
                   &tzSign, &tzHour, &tzMin);
            
            if (parsed >= 6) {
                tm.tm_year -= 1900;
                tm.tm_mon -= 1;
                tm.tm_isdst = 0;
                
                // mktime interprets tm as local time, but we want to treat it
                // as the timezone specified in the string. Convert to UTC.
                // First get the epoch assuming UTC (using timegm equivalent)
                time_t depEpoch = mktime(&tm);
                // mktime assumes local time (CET/CEST due to configTzTime),
                // so correct for local timezone offset
                struct tm check;
                localtime_r(&depEpoch, &check);
                depEpoch += check.tm_gmtoff; // Now it's as if tm was UTC
                
                // Apply the string's timezone offset to get true UTC
                int tzOffsetSec = (tzHour * 3600 + tzMin * 60);
                if (tzSign == '+') depEpoch -= tzOffsetSec;
                else depEpoch += tzOffsetSec;
                
                // time() on ESP32 returns UTC epoch
                time_t nowUtc;
                time(&nowUtc);
                
                d.minutesUntil = (int)((depEpoch - nowUtc) / 60);
                if (d.minutesUntil < 0) d.minutesUntil = 0;
            } else {
                d.minutesUntil = -1;
            }
        } else {
            d.minutesUntil = -1;
        }

        departureCount++;
    }
}

// Sort departures by minutesUntil (ascending)
void sortDepartures() {
    for (int i = 0; i < departureCount - 1; i++) {
        for (int j = i + 1; j < departureCount; j++) {
            if (departures[j].minutesUntil < departures[i].minutesUntil) {
                Departure tmp = departures[i];
                departures[i] = departures[j];
                departures[j] = tmp;
            }
        }
    }
    // Trim to max
    if (departureCount > BVG_MAX_DEPARTURES) {
        departureCount = BVG_MAX_DEPARTURES;
    }
}

// ===== Display Rendering =====
void renderDisplay() {
    matrix->clearScreen();

    if (departureCount == 0) {
        renderTextCentered("Warte auf Daten...", matrix->color565(255, 204, 0));
        return;
    }

    // Render up to DISPLAY_ROWS departures
    int rowHeight = 10;

    if (!scrollEnabled) {
        // Static mode: show first 3 departures only
        for (int i = 0; i < DISPLAY_ROWS && i < departureCount; i++) {
            renderDepartureRow(departures[i], i * rowHeight + 1);
        }
    } else {
        // Scroll mode
        for (int i = 0; i < DISPLAY_ROWS && i < departureCount; i++) {
            int depIdx = (scrollOffset + i) % departureCount;
            renderDepartureRow(departures[depIdx], i * rowHeight + 1);
        }

        // Advance scroll based on scrollSpeedSetting
        static int frameCount = 0;
        frameCount++;
        int framesPerScroll = scrollSpeedSetting / SCROLL_SPEED;
        if (frameCount >= framesPerScroll && departureCount > DISPLAY_ROWS) {
            scrollOffset = (scrollOffset + 1) % departureCount;
            frameCount = 0;
        }
    }
}

