jako-dev/bvg-display/esp32/src/main.cpp
void renderDepartureRow(const Departure& dep, int y) {
    uint16_t lineColor = getLineColor(dep.product, dep.lineName);
    uint16_t white = matrix->color565(255, 255, 255);
    uint16_t yellow = matrix->color565(255, 204, 0);
    uint16_t red = matrix->color565(255, 0, 0);
    uint16_t green = matrix->color565(0, 255, 0);

    // Line badge background
    int badgeWidth = dep.lineName.length() * 5 + 2;
    matrix->fillRect(0, y, badgeWidth, 8, lineColor);

    // Line name
    uint16_t textColor = white;
    drawString(matrix, dep.lineName.c_str(), 1, y + 1, textColor);

    // Direction (truncated)
    int destX = badgeWidth + 2;
    String truncDir = dep.direction.substring(0, 14);
    uint16_t destColor = dep.cancelled ? matrix->color565(100, 100, 100) : white;
    drawString(matrix, truncDir.c_str(), destX, y + 1, destColor);

    // Time
    String timeStr;
    uint16_t timeColor;
    if (dep.cancelled) {
        timeStr = "X";
        timeColor = red;
    } else if (dep.minutesUntil <= 0) {
        timeStr = "jetzt";
        timeColor = green;
    } else if (dep.minutesUntil < 60) {
        timeStr = String(dep.minutesUntil) + "'";
        timeColor = (dep.delaySeconds > 120) ? red : yellow;
    } else {
        timeStr = String(dep.minutesUntil / 60) + "h";
        timeColor = yellow;
    }

    int timeWidth = measureString(timeStr.c_str());
    drawString(matrix, timeStr.c_str(), MATRIX_WIDTH - timeWidth - 1, y + 1, timeColor);
}

void renderTextCentered(const char* text, uint16_t color) {
    int w = measureString(text);
    int x = (MATRIX_WIDTH - w) / 2;
    int y = (MATRIX_HEIGHT - 7) / 2;
    drawString(matrix, text, x, y, color);
}

void renderSetupScreen() {
    static unsigned long lastBlink = 0;
    static bool showIP = true;
    
    matrix->clearScreen();
    
    uint16_t yellow = matrix->color565(255, 204, 0);
    uint16_t cyan = matrix->color565(0, 200, 255);
    
    drawString(matrix, "BVG Display", 20, 2, yellow);
    
    if (millis() - lastBlink > 2000) {
        showIP = !showIP;
        lastBlink = millis();
    }
    
    if (showIP) {
        String ip = WiFi.softAPIP().toString();
        drawString(matrix, ip.c_str(), 10, 14, cyan);
    } else {
        drawString(matrix, "WiFi: BVG-Display", 2, 14, cyan);
    }
    
    drawString(matrix, "Setup via Browser", 5, 24, matrix->color565(150, 150, 150));
}

// ===== Line Colors =====
uint16_t getLineColor(const String& product, const String& lineName) {
    String name = lineName;
    name.toLowerCase();
    
    // Specific U-Bahn colors
    if (name == "u1") return matrix->color565(125, 173, 76);
    if (name == "u2") return matrix->color565(218, 66, 30);
    if (name == "u3") return matrix->color565(0, 122, 91);
    if (name == "u4") return matrix->color565(240, 215, 34);
    if (name == "u5") return matrix->color565(126, 83, 48);
    if (name == "u6") return matrix->color565(140, 109, 171);
    if (name == "u7") return matrix->color565(82, 141, 186);
    if (name == "u8") return matrix->color565(34, 79, 134);
    if (name == "u9") return matrix->color565(243, 121, 29);
    
    // Specific S-Bahn colors
    if (name == "s1") return matrix->color565(222, 77, 164);
    if (name == "s2" || name == "s25" || name == "s26") return matrix->color565(0, 95, 39);
    if (name == "s3") return matrix->color565(0, 96, 170);
    if (name == "s41") return matrix->color565(162, 59, 30);
    if (name == "s42") return matrix->color565(194, 106, 55);
    if (name == "s5") return matrix->color565(255, 89, 0);
    if (name == "s7" || name == "s75") return matrix->color565(119, 96, 176);
    if (name == "s8" || name == "s85") return matrix->color565(85, 168, 34);
    if (name == "s9") return matrix->color565(139, 28, 98);
    
    // Generic product colors
    if (product == "suburban") return matrix->color565(0, 141, 79);
    if (product == "subway") return matrix->color565(0, 96, 170);
    if (product == "tram") return matrix->color565(190, 20, 20);
    if (product == "bus") return matrix->color565(155, 39, 144);
    if (product == "ferry") return matrix->color565(0, 137, 180);
    if (product == "express") return matrix->color565(100, 100, 100);
    if (product == "regional") return matrix->color565(227, 6, 19);
    
    return matrix->color565(255, 204, 0); // default yellow
}

// ===== Settings Persistence =====
void loadSettings() {
    prefs.begin(PREFS_NAMESPACE, true);
    wifiSSID = prefs.getString("ssid", "");
    wifiPassword = prefs.getString("pass", "");
    stationCount = prefs.getInt("stCount", 0);
    
    depCountSetting = prefs.getInt("depCount", 6);
    scrollEnabled = prefs.getBool("scrollOn", false);
    scrollSpeedSetting = prefs.getInt("scrollSpd", 3000);
    
    for (int i = 0; i < stationCount && i < MAX_STATIONS; i++) {
        stations[i].id = prefs.getString(("st_id_" + String(i)).c_str(), "");
        stations[i].name = prefs.getString(("st_nm_" + String(i)).c_str(), "");
        stations[i].walkTime = prefs.getInt(("st_wt_" + String(i)).c_str(), 0);
    }
    prefs.end();
    
    Serial.println("Loaded " + String(stationCount) + " stations, SSID: " + wifiSSID);
}

void saveSettings() {
    prefs.begin(PREFS_NAMESPACE, false);
    prefs.putString("ssid", wifiSSID);
    prefs.putString("pass", wifiPassword);
    prefs.putInt("stCount", stationCount);
    prefs.putInt("depCount", depCountSetting);
    prefs.putBool("scrollOn", scrollEnabled);
    prefs.putInt("scrollSpd", scrollSpeedSetting);
    
    for (int i = 0; i < stationCount; i++) {
        prefs.putString(("st_id_" + String(i)).c_str(), stations[i].id);
        prefs.putString(("st_nm_" + String(i)).c_str(), stations[i].name);
        prefs.putInt(("st_wt_" + String(i)).c_str(), stations[i].walkTime);
    }
    prefs.end();
}

// ===== Utility =====
String urlEncode(const String& str) {
    String encoded = "";
    for (unsigned int i = 0; i < str.length(); i++) {
        char c = str[i];
        if (isalnum(c) || c == '-' || c == '_' || c == '.' || c == '~') {
            encoded += c;
        } else {
            char buf[4];
            snprintf(buf, sizeof(buf), "%%%02X", (unsigned char)c);
            encoded += buf;
        }
    }
    return encoded;
}
